// 1. Функції-конструктори
// Створіть функцію-конструктор User, яка приймає ім'я та вік користувача.
// Додайте метод sayHello, який виводить у консоль привітання з ім'ям користувача.

function User(name, age) {
    this.name = name;
    this.age = age;
}

User.prototype.sayHello = function () {
    console.log(`Hello my name is ${this.name}`)
}
let user1 = new User('Vasya', 34);
console.log(user1);

user1.sayHello();

// Створіть функцію-конструктор Car, яка приймає марку, модель і рік випуску автомобіля.
// Додайте метод getCarInfo, який повертає рядок із інформацією про автомобіль.

// 2. Розширення через prototype
// Додайте до функції-конструктора User метод isAdult, який перевіряє,
// чи є користувач повнолітнім (вік >= 18).

// Створіть функцію-конструктор Rectangle, яка приймає ширину та висоту.
// Додайте метод через prototype, який обчислює площу прямокутника.

// 3. Підміна this через call, apply, bind
// Створіть об'єкт person із методом introduce, який виводить ім'я та вік.
// Використайте call, щоб викликати цей метод для іншого об'єкта.

// Створіть функцію multiply, яка приймає два числа. Використайте bind, щоб створити нову функцію,
// яка завжди множить на 2.

// 4. Класи та наслідування
// Створіть клас Animal із методом makeSound, який виводить "Some generic sound".
// Створіть клас Dog, який наслідує Animal, і перевизначте метод makeSound, щоб він виводив "Woof!".

// Створіть клас Person із властивостями name та age. Створіть клас Student, який наслідує Person,
// і додайте властивість grade. Додайте метод introduce, який виводить ім'я, вік і клас студента.

// 5. Колекції: Set
// Створіть Set, який містить унікальні числа. Додайте кілька чисел, видаліть одне з них і перевірте,
// чи містить Set певне число.

// 6. Колекції: Map
// Створіть Map, який зберігає інформацію про студентів (ключ — ім'я, значення — оцінка).
// Додайте кілька студентів, отримайте оцінку одного з них і видаліть іншого.
